#+TITLE: Flex & Bison
#+AUTHOR: John Levin
#+DATE: 2009
#+EMAIL: evan@mantle.co
#+CREATOR: Evan Nagle
#+TAGS: @c @linux @flex @bison

* Introduction
** Lexing = scanning = parsing text into tokens
** Parsing = determines **relationship** amongst tokens
   Converts stream of tokens into a tree of tokens.
** Structure of a Lex/Bison file:   

   %{
   //PROLOGUE in C
   #include <stdio.h>
   #define BRITNEY "spears"
   %}

   %%

   Grammar Rules

   %%

   Epilogue

   int main(int argc, char **argv) {
   printf("%s\n", "here we go!");
   yylex(); ==> runs the lexer
   return 0;
   }

** Simple Flex Makefile

   #+BEGIN_SRC Makefile
APP       = app
APP_L     = $(APP).l
LC        = flex
LFLAGS    = 
CC        = gcc
CFLAGS    =

all: $(APP)

# lex.yy.c is the file outputted by Flex
# running flex app.l
lex.yy.c: $(APP_L)
    $(LC) $(LFLAGS) $(APP_L)

# running gcc -o app lex.yy.c
$(APP): lex.yy.c
    $(CC) $(CFLAGS) -o $(APP) lex.yy.c

   #+END_SRC
* Some Flex-Only Examples
** wc

   #+BEGIN_SRC sh
echo "here I am" | ./data/wc/wc
   #+END_SRC

   #+RESULTS:
   | chars: | 10 |
   | words: |  3 |
   | lines: |  1 |


** wc with file management
   
#+BEGIN_SRC sh
./data/wcf/wc ./data/wcf/*.poem
#+END_SRC

#+RESULTS:
| ./data/wcf/hunting-of-the-snark.poem | 25581 | 4519 |  724 |
| ./data/wcf/jabberwocky.poem          | 26639 | 4686 |  757 |
| *TOTAL*                              | 52220 | 9205 | 1481 |

** colour

   #+BEGIN_SRC sh
echo "What colour is this?" | ./data/colour/colour
   #+END_SRC

   #+RESULTS:
   : What color is this?

** dumber

   #+BEGIN_SRC sh :results scalar
echo "1 + 2 * 10 / 5x" | ./data/dumbers/dumbers
   #+END_SRC

   #+RESULTS:
   : NUMBER 1
   : PLUS
   : NUMBER 2
   : TIMES
   : NUMBER 10
   : DIVIDE
   : NUMBER 5
   : MYSTERY CHAR x
   : NEWLINE

** number lexer

   #+BEGIN_SRC sh
echo "1 * 24 - 14" | ./data/number-scanner/number-scanner
   #+END_SRC

   #+RESULTS:
   | 258 |  1 |
   | 261 |    |
   | 258 | 24 |
   | 260 |    |
   | 258 | 14 |
   | 264 |    |
* Flex Regexes

  |---------+------------------------------------------------------------------------------------------|
  | pattern | matches                                                                                  |
  |---------+------------------------------------------------------------------------------------------|
  | .       | Any single char except \n                                                                |
  | []      | Character class                                                                          |
  | ^       | Beginning of line                                                                        |
  | $       | End of line                                                                              |
  | {}      | Min and max occurrences                                                                  |
  | \       | Escape                                                                                   |
  | **      | Zero or more occurrences                                                                 |
  | +       | One or more occurrences                                                                  |
  | ?       | Zero or one occurrences                                                                  |
  | \vert   | Or operator                                                                              |
  | "..."   | Literal expression                                                                       |
  | ()      | Group                                                                                    |
  | /       | Trailing context. Match regex preceding slash only if followed by regex proceeding slash |
  |---------+------------------------------------------------------------------------------------------|

** Ambiguous Patterns
*** It's hungry. Matches the longest possible string every pass.
*** If there's a tie, use the pattern that appears first in the expressions list.

* Bison and Flex Together
** In flex.l file  
*** remove enum yytokentype
*** also remove int yylval
*** also remove the int main() call   
*** import flex.tab.h, which is generated by bison   
** Sample: calculator

   #+BEGIN_SRC sh
echo "10 - 5" | ./data/calculator/calculator
echo "10 + 5" | ./data/calculator/calculator
echo "5 * 5" | ./data/calculator/calculator
echo "15 / 3 * 2" | ./data/calculator/calculator
   #+END_SRC

   #+RESULTS:
   | = |  5 |
   | = | 15 |
   | = | 25 |
   | = | 10 |

** Sample: calculator with parens and comments

   #+BEGIN_SRC sh
./data/calculator-p/calculator <<<'5 * (5 + 1) //should be thirty'
   #+END_SRC

   #+RESULTS:
   : = 30

** Sample: calculator with hand-written lexer
* Start States, Nested Require Statments

#+BEGIN_SRC sh :results scalar
./data/includer/includer ./data/includer/file1.txt
#+END_SRC

#+RESULTS:
:    1. Here is a line.
:    2. Here is another line.
:    3. 
:    1. First line in second file.
:    2. Second line in second file.
:    5. 
:    6. And a fourth line.
:    7. And a fifth line.
* Symbol Tables

#+BEGIN_SRC sh :results scalar
./data/concordance/concordance ./data/concordance/*.poem | head -n 50
#+END_SRC

#+RESULTS:
#+begin_example

"All"
- ./data/concordance/love.poem           :70   
                                         :73   

"Already"
- ./data/concordance/love.poem           :133  

"America"
- ./data/concordance/love.poem           :199  

"Angel"
- ./data/concordance/love.poem           :67   

"Another"
- ./data/concordance/love.poem           :49   

"Antarctic"
- ./data/concordance/love.poem           :142  

"Ask"
- ./data/concordance/love.poem           :181  

"Barbie"
- ./data/concordance/love.poem           :190  

"Becoming"
- ./data/concordance/love.poem           :46   

"Befriend"
- ./data/concordance/love.poem           :160  

"Bird"
- ./data/concordance/redbird.poem        :8    

"Careless"
- ./data/concordance/love.poem           :178  

"Carrie"
- ./data/concordance/love.poem           :175  

"Change"
- ./data/concordance/love.poem           :166  

"Chocolates"
- ./data/concordance/love.poem           :13   

"Demons"
- ./data/concordance/love.poem           :202  

#+end_example

* Creating a C cross-referencer

#+BEGIN_SRC sh
./data/cross-ref/cross-ref ./data/cross-ref/cross-ref.l | head -n 30
#+END_SRC

#+RESULTS:
| BEGIN             | :49   |   50 |      |      |     |     |
| COMMENT           | :3    |   49 |   50 |   51 |  52 |     |
| EOF               | :52   |      |      |      |     |     |
| EXP               | :7    |  104 |      |      |     |     |
| Ee                | :7    |      |      |      |     |     |
| F                 | :6    |  102 |  106 |      |     |     |
| FILE              | :23   |  253 |      |      |     |     |
| IFILE             | :4    |      |      |      |     |     |
| ILEN              | :8    |  100 |  101 |  102 |     |     |
| INITIAL           | :50   |      |      |      |     |     |
| L                 | :8    |      |      |      |     |     |
| LL                | :8    |      |      |      |     |     |
| Mystery           | :145  |      |      |      |     |     |
| NHASH             | :39*  | 175* | 176* |  185 | 223 | 224 |
| NULL              | :225* |      |      |      |     |     |
| Pp                | :106  |      |      |      |     |     |
| U                 | :6    |      |      |      |     |     |
| UCN               | :6    |   57 |      |      |     |     |
| Uu                | :8    |      |      |      |     |     |
| Xx                | :102  |  106 |      |      |     |     |
| YY_BUFFER_STATE   | :20   |      |      |      |     |     |
| YY_BUF_SIZE       | :261  |      |      |      |     |     |
| a                 | :6    |  102 |  106 | 211* | 213 | 218 |
| abort             | :188  |  201 |      |      |     |     |
| add_file_to_stack | :41*  |      |      |      |     |     |
| addref            | :15*  | 191* |      |      |     |     |
| argc              | :151* |  154 |  159 |      |     |     |
| argv              | :151* |  160 |      |      |     |     |
| b                 | :212* |  214 |  217 |  218 |     |     |
| bad               | :138  |      |      |      |     |     |
